{
    "content": [
      {
        "id": "1",
        "title": "Tech Interview Cheat Sheet",
        "type": "Repository",
        "description": "This list is meant to be both a quick guide and reference for further research into these topics. It's basically a summary of that comp sci course you never took or forgot about, so there's no way it can cover everything in depth.",
        "level": "Intermediate",
        "author": "tsiege",
        "info": {
          "category": "interview",
          "link": "https://github.com/tsiege/Tech-Interview-Cheat-Sheet",
          "published": "2019"
        }
      },
      {
        "id": "2",
        "title": "free-for.dev",
        "type": "Repository",
        "description": "Developers and Open Source authors now have many services offering free tiers, but finding them all takes time to make informed decisions. This is a list of software (SaaS, PaaS, IaaS, etc.) and other offerings with free developer tiers. The scope of this particular list is limited to things that infrastructure developers (System Administrator, DevOps Practitioners, etc.) are likely to find useful. We love all the free services out there, but it would be good to keep it on topic. It's a grey line sometimes, so this is opinionated; please don't feel offended if I don't accept your contribution. This list results from Pull Requests, reviews, ideas, and work done by 1600+ people. You can also help by sending Pull Requests to add more services or remove ones whose offerings have changed or been retired.",
        "level": "Everyone",
        "author": "ripienaar",
        "info": {
          "category": "general skills",
          "link": "https://github.com/ripienaar/free-for-dev",
          "published": "2019"
        }
      },
      {
        "id": "3",
        "title": "Tech Interview Handbook",
        "type": "Website",
        "description": "Tech Interview Handbook goes straight to the point and tells you the minimum you need to know to excel in your technical interviews. Having personally gone through the interviewing process, it was frustrating to have to find resources from everywhere to prepare for my technical interviews. This handbook contains the essence of technical interviewing I gathered over my last job hunt, which allowed me to clinch 9 offers out of 11 top Bay Area companies - Google, Airbnb, Palantir, Dropbox, Lyft, and some startups! A senior Netflix engineer used Tech Interview Handbook and got 7 offers from 7 companies with the top offer being $800k USD 🤯!",
        "level": "Everyone",
        "author": "Yangshun Tay",
        "info": {
          "category": "Career Development",
          "link": "https://www.techinterviewhandbook.org/",
          "published": "N/A"
        }
      },
      {
        "id": "4",
        "title": "Node.js Basics",
        "type": "Website",
        "description": "Node.js is an open-source server side runtime environment built on Chrome's V8 JavaScript engine. It provides an event driven, non-blocking (asynchronous) I/O and cross-platform runtime environment for building highly scalable server-side applications using JavaScript. Learn more about Node.js here!",
        "level": "Beginner",
        "author": "Pradeep Kumar",
        "info": {
          "category": "Web Development",
          "link": "https://learning-zone.github.io/nodejs-basics/",
          "published": "2019"
        }
      },
      {
        "id": "5",
        "title": "Flexbox Guide",
        "type": "Website",
        "description": "⚡ A Guide for the concept of Flexbox and responsive design. Simply set the attributes as you needed and copy the CSS code. 🎉",
        "level": "Beginner",
        "author": "Sourav Dey",
        "info": {
          "category": "Web Development",
          "link": "https://flexbox-guide-souravdey777.vercel.app/",
          "published": "2020"
        }
      },
      {
        "id": "6",
        "title": "Website Templates",
        "type": "Repository",
        "description": "Find the perfect website template for you in this list of over 150+ resources at your disposal.",
        "level": "Everyone",
        "author": "learning-zone",
        "info": {
          "category": "Web Development",
          "link": "https://github.com/learning-zone/website-templates",
          "published": "2019"
        }
      },
      {
        "id": "7",
        "type": "",
        "description": "",
        "level": "",
        "author": "",
        "info": {
          "category": "",
          "link": "",
          "tags": "",
          "published": "",
          "rating": ""
        }
      },
      {
        "id": "8",
        "title": "",
        "type": "",
        "description": "",
        "level": "",
        "author": "",
        "info": {
          "category": "",
          "link": "",
          "tags": "",
          "published": "",
          "rating": ""
        }
      },
      {
        "id": "9",
        "title": "",
        "type": "",
        "description": "",
        "level": "",
        "author": "",
        "info": {
          "category": "",
          "link": "",
          "tags": "",
          "published": "",
          "rating": ""
        }
      }
    ]
}